Repository: Sager1145/Japan-Train-Map
Catalog: ios/Resources/Localizable.xcstrings
Source language: zh_hant
Languages: en, ja, zh_hans

# menu.show
source: 顯示選單
en: Show menu
ja: メニューを表示
zh_hans: 显示选单

# modal.cancel
source: 取消
en: Cancel
ja: キャンセル

# modal.ok
source: 確定
en: OK
ja: OK
zh_hans: 确定

# mode.newYearGrandLoop
source: 目前顯示：跨年大回行程（更改不會保存）
en: Showing: New Year grand loop (changes are not saved)
ja: 表示中：年越し大回り行程（変更は保存されません）
zh_hans: 当前显示：跨年大回行程（更改不会保存）

# mode.sampleAll
source: 目前顯示：全部示例資料（更改不會保存）
en: Showing: full sample data (changes are not saved)
ja: 表示中：サンプルデータ全件（変更は保存されません）
zh_hans: 当前显示：全部示例数据（更改不会保存）

# mode.sampleSingle
source: 目前顯示：示例資料 {date}（更改不會保存）
en: Showing: sample data {date} (changes are not saved)
ja: 表示中：サンプルデータ {date}（変更は保存されません）
zh_hans: 当前显示：示例数据 {date}（更改不会保存）

# mode.tokyoLimitedExpressLoop
source: 目前顯示：東京特急大回行程（更改不會保存）
en: Showing: Tokyo limited-express loop (changes are not saved)
ja: 表示中：東京特急大回り行程（変更は保存されません）
zh_hans: 当前显示：东京特急大回行程（更改不会保存）

# mode.user
source: 目前顯示：我的資料（自動保存在此瀏覽器）
en: Showing: my data (auto-saved in this browser)
ja: 表示中：自分のデータ（このブラウザに自動保存）
zh_hans: 当前显示：我的数据（自动保存在此浏览器）

# nav.about
source: 說明
en: About
ja: 情報
zh_hans: 说明

# nav.data
source: 資料
en: Data
ja: データ
zh_hans: 数据

# nav.display
source: 顯示
en: Display
ja: 表示
zh_hans: 显示

# nav.editor
source: 編輯
en: Edit
ja: 編集
zh_hans: 编辑

# nav.label
source: 工作區導覽
en: Workspace navigation
ja: ワークスペースナビゲーション
zh_hans: 工作区导航

# nav.stats
source: 統計
en: Stats
zh_hans: 统计

# nav.trains
source: 列車
en: Trains
zh_hans: 列车

# ph.company
source: JR西日本；直通用／分隔多家公司
en: e.g. JR西日本; separate through-service companies with /
ja: JR西日本。直通運転は複数社を / で区切る

# ph.direction
source: 下行／上行
en: Inbound / Outbound
ja: 下り／上り

# ph.importJson
source: 貼上完整 store：{"schema_version":"1.3","trains":[...]}，也可貼上列車陣列或單一列車物件
en: Paste a full store: {"schema_version":"1.3","trains":[...]}, or a train array or a single train object
ja: 完全な store、列車配列、または単一の列車オブジェクトを貼り付け
zh_hans: 粘贴完整 store：{"schema_version":"1.3","trains":[...]}，也可粘贴列车阵列或单一列车对象

# ph.search
source: 搜尋車次、列車、車站或 ID
en: Search by train number, name, station or ID
ja: 列車番号・列車名・駅名・ID で検索
zh_hans: 搜索车次、列车、车站或 ID

# ph.trainType
source: 特急／普通／新幹線
en: Ltd. Exp. / Local / Shinkansen
zh_hans: 特急／普通／新干线

# ph.trainType.hk
source: 普通／機場快綫
en: Local / Airport Express
ja: 普通／エアポートエクスプレス
zh_hans: 普通／机場快綫

# ph.trainType.mo
source: 普通
en: Local

# ph.trainType.tw
source: 自強／區間／高鐵
en: Tze-Chiang / Local / HSR
zh_hans: 自強／区间／高铁

# play.bar
source: 行程播放
en: Journey playback
ja: 行程再生

# play.busy
source: 資料載入中，稍後再播放。
en: Data is still loading — try playing again shortly.
ja: データを読み込み中です。少し待ってから再生してください。
zh_hans: 数据加载中，稍后再播放。

# play.done
source: 播放完畢
en: Playback finished
ja: 再生が終わりました

# play.empty
source: 目前列表沒有可播放的列車。
en: No playable train in the current list.
ja: 現在のリストに再生できる列車がありません。
zh_hans: 当前列表没有可播放的列车。

# play.next
source: 下一趟
en: Next train
ja: 次の列車

# play.pause
source: 暫停
en: Pause
ja: 一時停止
zh_hans: 暂停

# play.prev
source: 上一趟
en: Previous train
ja: 前の列車

# play.replay
source: 重播
en: Replay
ja: もう一度

# play.resume
source: 播放
en: Play
ja: 再生

# play.speed
source: 速度
en: Speed

# play.stop
source: 結束播放
en: Stop playback
ja: 再生を終了
zh_hans: 结束播放

# popup.arrival
source: 到達
en: Arrival
ja: 到着
zh_hans: 到达

# popup.computed
source: 自動推定
en: Computed
zh_hans: 自动推定

# popup.departure
source: 出發
en: Departure
ja: 出発
zh_hans: 出发

# popup.line
source: 路線
en: Line
zh_hans: 路线

# popup.no
source: 否
en: No
ja: いいえ

# popup.noPale
source: 否（淡色顯示）
en: No / pale
ja: いいえ（淡色表示）
zh_hans: 否（淡色显示）

# popup.operator
source: 營運公司
en: Operator
ja: 事業者
zh_hans: 运营公司

# popup.rideSegment
source: 乘坐區間
en: Ridden segment
ja: 乗車区間
zh_hans: 乘坐区间

# popup.routeSource
source: 路線來源
en: Route source
ja: 経路ソース
zh_hans: 路线来源

# popup.sourceStationOverlay
source: 站點圖層
en: station overlay
ja: 駅レイヤー
zh_hans: 站点图层

# popup.station
source: 車站
en: Station
ja: 駅
zh_hans: 车站

# popup.stationGroup
source: 站點群組
en: Station group
ja: 駅グループ
zh_hans: 站点群組

# popup.stopType
source: 停站類型
en: Stop type
ja: 停車種別
zh_hans: 停站类型

# popup.trainId
source: 列車 ID
en: Train ID
zh_hans: 列车 ID

# popup.typeCompany
source: 類型／公司
en: Type / Company
ja: 種別・会社
zh_hans: 类型／公司

# popup.yes
source: 是
en: Yes
ja: はい

# prog.done
source: 完成：{count} 趟列車
en: Done: {count} train(s)
ja: 完了：{count} 本
zh_hans: 完成：{count} 趟列车

# prog.loading
source: 正在逐條載入 {label}：{count}/{total}：{id}
en: Loading {label} item by item: {count}/{total}: {id}
ja: {label} を順次読み込み中：{count}/{total}：{id}
zh_hans: 正在逐条加载 {label}：{count}/{total}：{id}

# prog.loadingShort
source: 正在逐條載入 {count}/{total}：{id}
en: Loading item by item: {count}/{total}: {id}
ja: 順次読み込み中：{count}/{total}：{id}
zh_hans: 正在逐条加载 {count}/{total}：{id}

# prog.openingLocal
source: 正在打開本地 JSON…
en: Opening local JSON…
ja: ローカル JSON を開いています…
zh_hans: 正在打开本地 JSON…

# prog.prepare
source: 準備逐條載入 {label}：0/{total}
en: Preparing to load {label} item by item: 0/{total}
ja: {label} の順次読み込みを準備中：0/{total}
zh_hans: 准备逐条加载 {label}：0/{total}

# prog.preparingId
source: 準備載入
en: preparing
ja: 準備中
zh_hans: 准备加载

# prompt.addDate
source: 輸入新增日期（YYYY-MM-DD）：
en: Enter a new date (YYYY-MM-DD):
ja: 追加する日付を入力してください（YYYY-MM-DD）：
zh_hans: 输入新增日期（YYYY-MM-DD）：

# sec.dataSource
source: 資料來源
en: Data Source
ja: データソース
zh_hans: 数据来源

# sec.export
source: JSON 匯出
en: JSON Export
ja: JSON 書き出し
zh_hans: JSON 导出

# sec.import
source: JSON 匯入／本地資料
en: JSON Import / Local Data
ja: JSON 読み込み／ローカルデータ
zh_hans: JSON 导入／本地数据

# sec.importPaste
source: 貼上 JSON 文字
en: Paste JSON text
ja: JSONテキストを貼り付け
zh_hans: 粘贴 JSON 文字

# sec.legend
source: 圖例與資料來源
en: Legend & Data Sources
ja: 凡例とデータ出典
zh_hans: 图例与数据来源

# sec.list
source: 列車清單
en: Train List
ja: 列車一覧
zh_hans: 列车清单

# sec.rawPreview
source: 原始 JSON 預覽
en: Raw JSON preview
ja: JSONプレビュー
zh_hans: 原始 JSON 预览

# sec.search
source: 搜尋與操作
en: Search & Actions
ja: 検索と操作
zh_hans: 搜索与操作

# sec.stats
source: 里程統計
en: Mileage Stats
ja: 走行距離統計
zh_hans: 里程统计

# sec.stops
source: 停靠站與通過站
en: Stops & Pass-throughs
ja: 停車駅と通過駅
zh_hans: 停靠站与通过站

# sec.trainData
source: 列車資料
en: Train Data
ja: 列車データ
zh_hans: 列车数据

# src.agentImport
source: AI 代理導入
en: AI agent import
ja: AI エージェントからの読み込み
zh_hans: AI 代理导入

# src.builtinDefault
source: 內建預設 JSON
en: built-in default JSON
ja: 内蔵の初期 JSON
zh_hans: 内置默认 JSON

# src.emptyStore
source: 空白資料
en: empty store
ja: 空のデータ
zh_hans: 空白数据

# src.localJson
source: 本地 JSON：{name}
en: local JSON: {name}
ja: ローカル JSON：{name}

# src.newYearGrandLoop
source: 跨年大回行程
en: New Year grand loop
ja: 年越し大回り行程

# src.otherUpdate
source: 其他來源更新
en: update from another source
ja: 別のソースからの更新
zh_hans: 其他来源更新

# src.pendingRecovery
source: 瀏覽器中尚未送達伺服器的恢復副本
en: unsent browser recovery copy
ja: ブラウザー内の未送信リカバリーコピー
zh_hans: 浏览器中尚未送达服务器的恢复副本

# src.sampleAll
source: 全部示例資料
en: full sample data
ja: サンプルデータ全件
zh_hans: 全部示例数据

# src.sampleDay
source: 示例資料 {date}
en: sample data {date}
ja: サンプルデータ {date}
zh_hans: 示例数据 {date}

# src.serverCleared
source: 伺服器已清除（內建預設）
en: server cleared (built-in defaults)
ja: サーバー消去済み（内蔵初期データ）
zh_hans: 服务器已清除（内置默认）

# src.serverStore
source: 伺服器保存的 train-store.json
en: server-saved train-store.json
ja: サーバー保存済み train-store.json
zh_hans: 服务器保存的 train-store.json

# src.tokyoLimitedExpressLoop
source: 東京特急大回行程
en: Tokyo limited-express loop
ja: 東京特急大回り行程
zh_hans: 东京特急大回行程

# src.userStore
source: 我的資料（此瀏覽器保存）
en: my data (saved in this browser)
ja: 自分のデータ（このブラウザ保存）
zh_hans: 我的数据（此浏览器保存）

# stat.all
source: 全國
en: Nationwide
ja: 全国
zh_hans: 全国

# stat.all.hk
source: 全港
en: Territory-wide
ja: 香港全域

# stat.all.kr
source: 全韓
en: Nationwide
ja: 韓国全域

# stat.all.mo
source: 全澳
en: Macao-wide
ja: マカオ全域

# stat.all.tw
source: 全島
en: Island-wide
zh_hans: 全岛

# stat.allrail
source: 全部鐵道
en: All Railways
ja: 全鉄道
zh_hans: 全部铁道

# stat.conv
source: 普通鐵道（在來線）
en: Conventional rail
ja: 普通鉄道（在来線）
zh_hans: 普通铁道（在来线）

# stat.conv.kr
source: 韓國鐵道（一般鐵道）
en: KORAIL conventional
ja: 韓国鉄道（一般鉄道）
zh_hans: 韓国铁道（一般铁道）

# stat.conv.tw
source: 臺鐵
en: Taiwan Railway (TRA)
ja: 台湾鉄路（TRA）
zh_hans: 台铁

# stat.hsr
source: 新幹線
en: Shinkansen
zh_hans: 新干线

# stat.hsr.kr
source: 高速鐵道（KTX・SRT）
en: High Speed Rail (KTX/SRT)
ja: 高速鉄道（KTX・SRT）
zh_hans: 高速铁道（KTX・SRT）

# stat.hsr.tw
source: 高鐵
en: High Speed Rail
ja: 台湾高速鉄道
zh_hans: 高铁

# stat.jr
source: JR（含新幹線）
en: JR (incl. Shinkansen)
ja: JR（新幹線を含む）
zh_hans: JR（含新干线）

# stat.jrconv
source: JR在來線
en: JR Conventional
ja: JR在来線
zh_hans: JR在来线

# stat.jrconv.tw
source: 臺鐵
en: Taiwan Railway (TRA)
ja: 台湾鉄路（TRA）
zh_hans: 台铁

# stat.ltdexp
source: 有料特急
en: Paid Ltd. Express

# stat.ltdexp.tw
source: 對號列車
en: Reserved-seat express
ja: 座席指定列車
zh_hans: 對号列车

# stat.metro
source: 地下鐵
en: Subway
ja: 地下鉄
zh_hans: 地下铁

# stat.metro.hk
source: 港鐵重鐵
en: MTR heavy rail
ja: MTR（重鉄）
zh_hans: 港铁重铁

# stat.metro.kr
source: 都市鐵道
en: Urban rail
ja: 都市鉄道
zh_hans: 都市铁道

# stat.metro.mo
source: 澳門輕軌
en: Macao LRT
ja: マカオLRT
zh_hans: 澳门轻轨

# stat.metro.tw
source: 捷運
en: Metro
ja: MRT（捷運）
zh_hans: 捷运

# stat.othertrains
source: 其他列車
en: Other trains
ja: その他の列車
zh_hans: 其他列车

# stat.priv
source: 私鐵・第三部門
en: Private & 3rd-sector
ja: 私鉄・第三セクター
zh_hans: 私铁・第三部门

# stat.priv.hk
source: 電車
en: Tramways
ja: 香港トラム
zh_hans: 电车

# stat.priv.kr
source: 單軌・磁浮
en: Monorail & maglev
ja: モノレール・リニア
zh_hans: 单轨・磁浮

# stat.priv.tw
source: 阿里山林業鐵路
en: Alishan Forest Railway
ja: 阿里山森林鉄道
zh_hans: 阿里山林业铁路

# stat.rides
source: {n} 次
en: {n}×
ja: {n} 回

# stat.time
source: 乘車時間
en: Ride Time
ja: 乗車時間
zh_hans: 乘车时间

# stat.trains
source: {n} 班次
en: {n} train(s)
ja: {n} 本

# stat.tram
source: 路面電車
en: Trams
zh_hans: 路面电车

# stat.tram.hk
source: 輕鐵
en: Light Rail
ja: ライトレール（軽鉄）
zh_hans: 轻铁

# stat.tram.kr
source: 輕電鐵
en: Light rail
ja: 軽電鉄
zh_hans: 轻电铁

# stat.tram.tw
source: 輕軌
en: Light rail
ja: ライトレール
zh_hans: 轻轨

# state.hidden
source: 已隱藏
en: hidden
ja: 非表示
zh_hans: 已隐藏

# state.off
source: 關
en: Off
ja: オフ
zh_hans: 关

# state.on
source: 開
en: On
ja: オン
zh_hans: 开

# state.shown
source: 顯示中
en: shown
ja: 表示中
zh_hans: 显示中

# stats.actualTitle
source: 實際乘坐量
en: Actual Rides
ja: 実乗車量
zh_hans: 实际乘坐量

# stats.byCount
source: 依次數
en: By ride count
ja: 回数順
zh_hans: 依次数

# stats.byCountCount
source: 依次數（{count}）
en: By ride count ({count})
ja: 回数順（{count}）
zh_hans: 依次数（{count}）

# stats.byLine
source: 分線明細
en: By line
ja: 路線別
zh_hans: 分线明细

# stats.byLineCount
source: 分線明細（{count}）
en: By line ({count})
ja: 路線別（{count}）
zh_hans: 分线明细（{count}）

# stats.coverageTitle
source: 路網覆蓋率
en: Network Coverage
ja: 路線網カバー率
zh_hans: 路网覆盖率

# stats.dailyTitle
source: 當日統計（{date}）
en: Selected Day ({date})
ja: 当日の統計（{date}）
zh_hans: 当日统计（{date}）

# stats.empty
source: 尚無乘坐記錄。
en: No rides recorded yet.
ja: 乗車記録がありません。
zh_hans: 尚无乘坐记录。

# stats.hint
source: 依全部列車的實際乘坐區間（乘坐勾選）去重合併計算；總里程來自国土数値情報 N02-25 全路網。
en: Computed from every train's actually-ridden intervals (ride checkboxes), deduplicated across trains; totals come from the full N02-25 national network.
ja: 全列車で実際に乗車した区間を重複を除いて集計します。総延長は国土数値情報 N02-25 の全国鉄道網に基づきます。
zh_hans: 根据全部列车的实际乘坐区间（乘坐勾选）去重合并计算；总里程来自国土数值信息 N02-25 全路网。

# stats.loading
source: 正在載入路網資料…
en: Loading rail network…
ja: 鉄道路線データを読み込み中…
zh_hans: 正在加载路网数据…

# stats.overallTitle
source: 全部統計
en: All-Time Total
ja: 全期間の統計
zh_hans: 全部统计

# stats.topSegmentsHint
source: 以相鄰車站之間的區間計算，來回視為同一區間；次數為搭乘過的班次數。
en: Counted per station-to-station section; both directions share one row, and the count is how many services rode it.
ja: 隣接する駅と駅の間の区間で集計します。往復は同じ区間として扱い、回数は乗車した列車の本数です。
zh_hans: 以相邻车站之间的区间计算，来回视为同一区间；次数为搭乘过的班次数。

# stats.topSegmentsTitle
source: 最常乘坐區間
en: Most-Ridden Sections
ja: 最も乗車した区間
zh_hans: 最常乘坐区间

# stats.unavailableCountry
source: 統計目前僅支援日本的路網資料。
en: Statistics are currently available for the Japan rail network only.
ja: 統計は現在、日本の路線網データのみ対応しています。
zh_hans: 统计当前仅支持日本的路网数据。

# status.allDeleted
source: 已刪除所有列車。
en: All trains deleted.
ja: すべての列車を削除しました。
zh_hans: 已删除所有列车。

# status.autoLoaded
source: 已自動載入{label}：共 {count} 趟列車。
en: Auto-loaded {label}: {count} train(s).
ja: {label} を自動読み込みしました：{count} 本。
zh_hans: 已自动加载{label}：共 {count} 趟列车。

# status.autosaveConflict
source: 未保存：另一個分頁已更改 {date} 的資料。請先匯出此分頁的 JSON，再重新載入以免覆蓋較新的資料。
en: Not saved: another tab changed {date}. Export this tab’s JSON before reloading so the newer saved data is not overwritten.
ja: 未保存：別のタブが {date} のデータを変更しました。新しい保存データを上書きしないよう、このタブの JSON をエクスポートしてから再読み込みしてください。
zh_hans: 未保存：另一个分页已更改 {date} 的数据。请先导出此分页的 JSON，再重新加载以免覆盖较新的数据。

# status.autosaveFail
source: 自動保存到伺服器失敗：{msg}
en: Auto-save to server failed: {msg}
ja: サーバーへの自動保存に失敗しました：{msg}
zh_hans: 自动保存到服务器失败：{msg}

# status.autosaveLocalOk
source: 已自動保存到此瀏覽器。
en: Auto-saved in this browser.
ja: このブラウザに自動保存しました。
zh_hans: 已自动保存到此浏览器。

# status.autosaveOk
source: 已自動保存到伺服器。
en: Auto-saved to the server.
ja: サーバーに自動保存しました。
zh_hans: 已自动保存到服务器。

# status.clearFail
source: 清除保存資料失敗：{msg}
en: Failed to clear saved data: {msg}
ja: 保存データの消去に失敗しました：{msg}
zh_hans: 清除保存数据失败：{msg}

# status.clearedAll
source: 已清除保存的資料與本地檔案授權。下次開啟時會重新載入示例／預設資料。
en: Cleared the saved data and local file authorization. Sample/default data will load on the next visit.
ja: 保存済みデータとローカルファイル権限を消去しました。次回はサンプル／初期データを読み込みます。
zh_hans: 已清除保存的数据与本地文件授权。下次打开时会重新加载示例／默认数据。

# status.countrySwitchFailed
source: 切換地區失敗：{msg}
en: Region switch failed: {msg}
ja: 地域の切り替えに失敗しました：{msg}
zh_hans: 切换地区失败：{msg}

# status.countrySwitched
source: 已切換至{name}資料。
en: Switched to {name} data.
ja: {name}のデータに切り替えました。
zh_hans: 已切换至{name}数据。

# status.dateAdded
source: 已新增日期 {date}，並切換為當前匯入目標。
en: Added date {date} and switched the import target to it.
ja: {date} を追加し、現在の読み込み先に設定しました。
zh_hans: 已新增日期 {date}，并切换为当前导入目标。

# status.emptyDatesRemoved
source: 已刪除 {count} 個空日期。
en: Removed {count} empty date(s).
ja: 空の日付を {count} 件削除しました。
zh_hans: 已删除 {count} 个空日期。

# status.exported
source: 已將目前列車資料匯出到文字框。
en: Current train store exported to textarea.
ja: 現在の列車データをテキスト欄へ書き出しました。
zh_hans: 已将当前列车数据导出到文字框。

# status.fieldsSaved
source: 已套用欄位。
en: Fields saved.
ja: 項目を適用しました。
zh_hans: 已应用字段。

# status.importBusy
source: 資料載入中，請稍候再編輯。
en: Loading data — please wait before editing.
ja: データ読み込み中です。完了までお待ちください。
zh_hans: 数据加载中，请稍候再编辑。

# status.imported
source: 已匯入 {count} 趟列車：{ids}
en: Imported {count} train(s): {ids}
ja: {count} 本をインポートしました：{ids}
zh_hans: 已导入 {count} 趟列车：{ids}

# status.invalidDate
source: 無效的日期格式：「{input}」。請使用 YYYY-MM-DD。
en: Invalid date format: "{input}". Use YYYY-MM-DD.
ja: 日付形式が正しくありません：『{input}』。YYYY-MM-DD を使用してください。
zh_hans: 无效的日期格式：「{input}」。请使用 YYYY-MM-DD。

# status.loadFailed
source: 資料載入失敗：{msg}
en: Data load failed: {msg}
ja: データの読み込みに失敗しました：{msg}
zh_hans: 数据加载失败：{msg}

# status.loadedAll
source: 已逐條載入 {label}，共 {total} 趟列車。
en: Loaded {label} item by item: {total} train(s).
ja: {label} から {total} 本を順次読み込みました。
zh_hans: 已逐条加载 {label}，共 {total} 趟列车。

# status.newYearGrandLoopLoaded
source: 已載入跨年大回行程（{count} 趟列車）。此行程與一般示例分開，僅供瀏覽，更改不會保存。
en: Loaded the New Year grand loop ({count} trains). It is separate from the regular sample and is view-only; changes are not saved.
ja: 年越し大回り行程（{count} 本）を読み込みました。通常のサンプルとは別の閲覧専用データです。
zh_hans: 已加载跨年大回行程（{count} 趟列车）。此行程与一般示例分开，仅供浏览，更改不会保存。

# status.noEmptyDates
source: 沒有可刪除的空日期。
en: No empty dates to remove.
ja: 削除できる空の日付はありません。
zh_hans: 没有可删除的空日期。

# status.noFsApi
source: 此瀏覽器不支援直接寫入本地檔案，已改為下載 JSON。
en: This browser can't write local files directly; downloaded the JSON instead.
ja: このブラウザーはローカルファイルへの直接書き込みに対応していないため、JSON をダウンロードしました。
zh_hans: 此浏览器不支持直接写入本地文件，已改为下载 JSON。

# status.noSavedStore
source: 尚未有保存的 train-store.json，已載入內建預設資料。編輯後會自動保存到伺服器。
en: No saved train-store.json yet; loaded built-in defaults. Edits auto-save to the server.
ja: 保存済みの train-store.json がないため、内蔵初期データを読み込みました。編集内容はサーバーへ自動保存されます。
zh_hans: 尚未有保存的 train-store.json，已加载内置默认数据。编辑后会自动保存到服务器。

# status.noUserStore
source: 此瀏覽器中沒有已保存的資料。
en: No saved data in this browser.
ja: このブラウザに保存済みのデータはありません。
zh_hans: 此浏览器中没有已保存的数据。

# status.recoveryEntered
source: 已保存資料載入失敗：{msg}。已切換到唯讀恢復模式：自動保存停用，原始 JSON 已放入「JSON 匯出」框；可修正後重新匯入，或用「重置示例／清除保存資料」重新開始。
en: Saved data failed to load: {msg}. Read-only recovery mode: autosave is off and the raw JSON is in the Export box — fix and re-import it, or use Reset Sample / Clear Saved Data to start over.
ja: 保存データの読み込みに失敗しました：{msg}。読み取り専用の復旧モードに切り替えました：自動保存は無効化され、元の JSON は「JSON エクスポート」欄にあります。修正して再読み込みするか、「サンプルへリセット／保存データを消去」でやり直してください。
zh_hans: 已保存数据加载失败：{msg}。已切换到唯读恢复模式：自动保存停用，原始 JSON 已放入「JSON 导出」框；可修正后重新导入，或用「重置示例／清除保存数据」重新开始。

# status.recoveryNoSave
source: 唯讀恢復模式：自動保存已停用（原保存資料載入失敗）。
en: Read-only recovery mode: autosave is disabled (the saved store failed to load).
ja: 読み取り専用の復旧モード：自動保存は無効です（保存データの読み込みに失敗）。
zh_hans: 唯读恢复模式：自动保存已停用（原保存数据加载失败）。

# status.resetDefaults
source: 已重置為內建示例資料。
en: Reset to embedded defaults.
ja: 内蔵サンプルデータに戻しました。
zh_hans: 已重置为内置示例数据。

# status.restoredAll
source: 已從 {label} 逐條恢復 {total} 趟列車。
en: Restored {total} train(s) from {label} item by item.
ja: {label} から {total} 本を順次復元しました。
zh_hans: 已从 {label} 逐条恢复 {total} 趟列车。

# status.routeGenerateFailed
source: 無法為 {train} 生成 N02 鐵路路線：{failed} 段失敗。
en: Unable to generate N02 railway route for {train}. {failed} segment(s) failed.
ja: {train} の N02 経路を生成できませんでした（{failed} 区間失敗）。
zh_hans: 无法为 {train} 生成 N02 铁路路线：{failed} 段失败。

# status.routeGenerated
source: 已為 {train} 生成 {count} 段 N02 路線。
en: Generated {count} N02 route segment(s) for {train}.
ja: {train} の N02 経路を {count} 区間生成しました。
zh_hans: 已为 {train} 生成 {count} 段 N02 路线。

# status.routeGeneratedSkipped
source: 已為 {train} 生成 {count} 段 N02 路線；{skipped} 段無法生成，已略過。
en: Generated {count} N02 route segment(s) for {train}; {skipped} segment(s) skipped.
ja: {train} の N02 経路を {count} 区間生成しました（{skipped} 区間はスキップ）。
zh_hans: 已为 {train} 生成 {count} 段 N02 路线；{skipped} 段无法生成，已略过。

# status.routeGenerating
source: 正在為 {train} 生成 N02 鐵路路線…
en: Generating N02 railway route for {train}...
ja: {train} の N02 鉄道経路を生成しています…
zh_hans: 正在为 {train} 生成 N02 铁路路线…

# status.routeNoPath
source: 無法從內建 N02 資料生成鐵路路徑，請檢查車站代碼或 route_policy 設定；不會以直線代替。
en: No N02 railway path could be generated from embedded N02 data. Check station codes / route_policy. No fake straight line was drawn.
ja: 内蔵 N02 データから経路を生成できませんでした。駅コード／route_policy を確認してください。直線での代替描画は行いません。
zh_hans: 无法从内置 N02 数据生成铁路路径，请检查车站代码或 route_policy 设置；不会以直线代替。

# status.routeSectionsRebuilt
source: 已依停站重建路線：共 {count} 段。乘車區間以外的停站與區段將完全隱藏。
en: Route sections rebuilt. {count} segment(s) calculated. Stops/segments outside the ridden range are hidden entirely.
ja: 停車駅から経路を再構築しました：{count} 区間。乗車区間外の駅／区間は非表示になります。
zh_hans: 已根据停靠站重建路线：共 {count} 段。乘车区间以外的停站与区段将完全隐藏。

# status.sampleAllLoaded
source: 已載入全部示例資料（{count} 趟列車）。示例僅供瀏覽，更改不會保存。
en: Loaded the full sample data ({count} trains). The sample is view-only; changes are not saved.
ja: サンプルデータ全件（{count} 本）を読み込みました。閲覧専用のため変更は保存されません。
zh_hans: 已加载全部示例数据（{count} 趟列车）。示例仅供浏览，更改不会保存。

# status.sampleNoSave
source: 示例模式：更改不會保存。想保留目前內容，請在「資料」分頁按「保存為我的資料」。
en: Sample mode: changes are not saved. To keep the current content, press “Save as My Data” in the Data tab.
ja: サンプルモード：変更は保存されません。内容を残すには「データ」タブの「自分のデータとして保存」を押してください。
zh_hans: 示例模式：更改不会保存。想保留当前内容，请在「数据」分页按「保存为我的数据」。

# status.sampleSingleLoaded
source: 已載入示例資料 {date}（{count} 趟列車）。示例僅供瀏覽，不會保存；按「載入全部示例資料」可查看全部日期。
en: Loaded sample data for {date} ({count} trains). The sample is view-only and never saved; press “Load Full Sample Data” to see every date.
ja: サンプルデータ {date}（{count} 本）を読み込みました。サンプルは閲覧専用で保存されません。「サンプルデータを全て読み込む」で全日付を表示できます。
zh_hans: 已加载示例数据 {date}（{count} 趟列车）。示例仅供浏览，不会保存；按「加载全部示例数据」可查看全部日期。

# status.savedAsMine
source: 已保存為我的資料（{count} 趟列車），之後的編輯會自動保存在此瀏覽器。
en: Saved as my data ({count} trains). Future edits auto-save in this browser.
ja: 自分のデータとして保存しました（{count} 本）。以後の編集はこのブラウザに自動保存されます。
zh_hans: 已保存为我的数据（{count} 趟列车），之后的编辑会自动保存在此浏览器。

# status.savedTo
source: 已保存到 {name}。
en: Saved to {name}.
ja: {name} に保存しました。

# status.serverClearedFallback
source: 伺服器端的資料已被清除，已回退到內建預設。
en: Server data was cleared; fell back to built-in defaults.
ja: サーバー上のデータが消去されたため、内蔵初期データに戻しました。
zh_hans: 服务器端的数据已被清除，已回退到内置默认。

# status.shared
source: 已透過系統分享匯出
en: Exported via the system share sheet
ja: 共有シートからエクスポートしました
zh_hans: 已透过系统分享导出

# status.tokyoLimitedExpressLoopLoaded
source: 已載入東京特急大回行程（{count} 趟列車）。此行程與其他示例分開，僅供瀏覽，更改不會保存。
en: Loaded the Tokyo limited-express loop ({count} trains). It is separate from the other samples and is view-only; changes are not saved.
ja: 東京特急大回り行程（{count} 本）を読み込みました。他のサンプルとは別の閲覧専用データです。
zh_hans: 已加载东京特急大回行程（{count} 趟列车）。此行程与其他示例分开，仅供浏览，更改不会保存。

# stoptype.destination
source: 終站
en: Destination
ja: 終着駅
zh_hans: 终到站

# stoptype.operational_stop
source: 運轉停車
en: Operational stop
ja: 運転停車
zh_hans: 技术停车

# stoptype.origin
source: 起站
en: Origin
ja: 始発駅
zh_hans: 始发站

# stoptype.pass_through
source: 通過站
en: Pass-through
ja: 通過駅
zh_hans: 通过站

# stoptype.passenger_stop
source: 停靠站
en: Passenger stop
ja: 停車駅

# table.stopsLabel
source: 停靠站表格
en: Stops table
ja: 停車駅一覧表

# tag.arr
source: 到
en: Arr
ja: 着

# tag.dep
source: 發
en: Dep
ja: 発
zh_hans: 发

# tag.end
source: 終點
en: End
ja: 終点
zh_hans: 终点

# tag.start
source: 起點
en: Start
ja: 始点
zh_hans: 起点

# tag.through
source: 直通
en: Through

# th.actions
source: 操作
en: Actions

# th.arr
source: 到
en: Arr
ja: 着

# th.dep
source: 發
en: Dep
ja: 発
zh_hans: 发

# th.ride
source: 乘坐
en: Ride
ja: 乗車

# th.station
source: 車站
en: Station
ja: 駅
zh_hans: 车站

# th.type
source: 類型
en: Type
ja: 種別
zh_hans: 类型

# theme.dark
source: 暗色
en: Dark
ja: ダーク

# theme.label
source: 主題
en: Theme
ja: テーマ
zh_hans: 主题

# theme.light
source: 亮色
en: Light
ja: ライト

# theme.system
source: 跟隨系統
en: System
ja: システム
zh_hans: 跟随系统

# tip.overlap
source: 並行 {slot}/{count}（依日期排序）・橫移切換
en: Parallel {slot}/{count} (date order) · slide to switch
ja: 並行 {slot}/{count}（日付順）・横移動で切り替え
zh_hans: 并行 {slot}/{count}（按日期排序）・横移切换

# tip.passRideFollows
source: 通過站會跟隨其所在停靠區間顯示或隱藏，無法單獨切換。
en: Pass-through stations follow their stop interval and cannot be toggled individually.
ja: 通過駅は所属する停車区間の表示状態に従うため、個別には切り替えられません。
zh_hans: 通过站会跟随其所在停靠区间显示或隐藏，无法单独切换。

# tip.rideSegment
source: 此站是否按實際乘坐區間正常顯示；關閉時站點和相鄰區間淡色顯示
en: Whether this stop shows normally as part of the actual ridden segment; off dims the stop and adjacent segments
ja: 実際の乗車区間として通常表示するかを設定します。オフにすると駅と隣接区間を淡色表示します
zh_hans: 此站是否按实际乘坐区间正常显示；关闭时站点和相邻区间淡色显示

# uiMode.auto
source: 自動偵測
en: Auto detect
ja: 自動判定
zh_hans: 自动侦测

# uiMode.desktop
source: 桌面端
en: Desktop
ja: デスクトップ

# uiMode.device.computer
source: 電腦
en: computer
ja: コンピュータ
zh_hans: 电脑

# uiMode.device.phone
source: 手機
en: phone
ja: スマートフォン
zh_hans: 手机

# uiMode.device.tablet
source: 平板
en: tablet
ja: タブレット

# uiMode.label
source: UI 模式
en: UI mode
ja: UI モード

# uiMode.mobile
source: 移動端
en: Mobile
ja: モバイル
zh_hans: 移动端

# uiMode.status
source: 偵測：{device} · 目前：{mode}
en: Detected: {device} · Active: {mode}
ja: 検出：{device}・現在：{mode}
zh_hans: 侦测：{device} · 当前：{mode}

# unit.stops
source: 個停站
en: stops
ja: 駅
zh_hans: 个停靠站

# video.bitrate
source: 碼率
en: Bitrate
ja: ビットレート
zh_hans: 码率

# video.bitrate.high
source: 高
en: High

# video.bitrate.small
source: 省空間
en: Compact
ja: 軽量
zh_hans: 省空间

# video.bitrate.standard
source: 標準
en: Standard
zh_hans: 标准

# video.cancelExport
source: 取消
en: Cancel
ja: キャンセル

# video.empty
source: 沒有錄到任何畫面。
en: No frames were recorded.
ja: 映像が記録されませんでした。
zh_hans: 没有录到任何画面。

# video.export
source: 輸出影片
en: Export video
ja: 動画を書き出す
zh_hans: 输出影片

# video.failed
source: 影片輸出失敗：{msg}
en: Video export failed: {msg}
ja: 動画の書き出しに失敗しました：{msg}
zh_hans: 影片输出失败：{msg}

# video.noFrames
source: 地圖畫面沒有送出影格，請讓本分頁保持在前景後重試。
en: The map delivered no frames — bring this tab to the foreground and try again.
ja: 地図から映像が届きませんでした。このタブを前面にしてやり直してください。
zh_hans: 地图画面没有送出影格，请让本分页保持在前景后重试。

# video.preparing
source: 正在準備影片…
en: Preparing the video…
ja: 動画を準備しています…
zh_hans: 正在准备影片…

# video.quality
source: 畫質
en: Quality
ja: 画質
zh_hans: 画質

# video.quality.qmax
source: 原始（最高）
en: Source (max)
ja: 元のまま（最高）

# video.ready
source: 影片已完成：{name}
en: Video ready: {name}
ja: 動画ができました：{name}
